Repository: GSebastian/Clearscore-Test-iOS
Catalog: Clearscore Test/*.lproj/Localizable.strings
Languages: ro

# scoreView.intro
source: Your credit score is
ro: Scorul tau este

# scoreView.maxScoreFormattable
source: out of %d
ro: din %@

# scoreView.status.bright
source: Looking bright
ro: Arata insorit

# scoreView.status.neutral
source: Looking neutral
ro: Arata neutru

# scoreView.status.overcast
source: Looking overcast
ro: Arata innorat

# mainViewController.successView.detailButton
source: Find out more
ro: Afla mai multe

# mainViewController.failureView.description
source: There was a problem loading your data.
ro: Am intampinat o problema.

# mainViewController.failureView.button
source: Tap to try again
ro: Incercati din nou

# detailsViewController.titleFormattable
source: Your score is %d
ro: Scorul tau este %d

# detailsViewController.subtitle
source: Here are more details from your credit report
ro: Iata cateva detalii despre scorul tau

# detailsViewController.card1.primary
source: Short term credit limit
ro: Cat poti imprumuta pe termen scurt

# detailsViewController.card1.secondary
source: %@ is your limit for short term credit.
ro: Limita ta este %@.

# detailsViewController.card2.primary
source: Credit utilisation
ro: Ce procentaj folosesti

# detailsViewController.card2.secondary
source: Credit utilisation is at %d percent.
ro: Momentan, folosesti %d procente.

# detailsViewController.card3.primary
source: Short term debt
ro: Datoria pe termen scurt

# detailsViewController.card3.secondary
source: Your short term debt is %@.
ro: Datoria ta curenta este %@.

# detailsViewController.card4.primary
source: Next report
ro: Urmatorul raport

# detailsViewController.card4.secondary
source: Your next credit report is due in %d days.
ro: Urmatorul raport va fi in %d zile.
